//输入一个字符串，形如
//3072x1728,2720x1536,2560x1600,2560x1440,2304x1728,2048x1536,1920x1200,1920x1080,1440x900,1280x800,1280x720,1024x768,1024x640,800x600,800x500,800x450,640x480,640x400,640x360,480x360,480x300,480x270,320x240,320x200,320x180,240x180,176x144,160x120,160x100,160x90
//这是一个显示器支持的分辨率清单，中间逗号分隔。
//现在输入画面的宽和高，然后在上述清单中挑选一个最接近的分辨率输出
//比如输入2000，1000，输出的分辨率应该是1920x1080，因为其它分辨率的误差更大。
//完成如下程序
// 2021-11-14
#include <stdio.h>
#define ABS(VAL) (((VAL)>0)?(VAL):(-(VAL)))
int a[31]={3072,2720,2560,2560,2304,2048,1920,1920,1440,1280,1280,1024,1024,800,800,800,640,640,640,480,480,480,320,320,320,240,176,160,160,160};
int b[31]={1728,1536,1600,1440,1728,1536,1200,1080,900,800,720,768,640,600,500,450,480,400,360,360,300,270,240,200,180,180,144,120,100,90};
int mul[31]={5308416,4177920,4096000,3686400,3981312,3145728,2304000,2073600,1296000,1024000,921600,786432,655360,480000,400000,360000,307200,256000,230400,172800,144000,129600,76800,64000,57600,43200,25344,19200,16000,14400};

struct lists{
    int q[31];
	int z[31];
};
int main()
{
    char ress[2048];
    int x,y,i,j,product;   
	int k,t,flag;
	struct lists zi;
    x=0;
    y=0;
    scanf("%s", ress);
    sscanf(ress,"%dx%d",&x,&y);
    product=x*y;
for(i=0;i<31;i++){
	zi.q[i]=i;
	zi.z[i]=ABS(product-mul[i]);
}
for(i=0;i<30;i++){
	for(j=i+1;j<31;j++){
		if(zi.z[j]<zi.z[i]){
			k=zi.z[i];
			zi.z[i]=zi.z[j];
			zi.z[j]=k;
		    t=zi.q[i];
			zi.q[i]=zi.q[j];
			zi.q[j]=t;	
			}
		
	}
}
flag=0;
for(i=0;i<30;i++){
    if(zi.z[i]==zi.z[i+1]){
         flag++;
	}else{
		break;
	}
}
for(i=0;i<=flag;i++){
    printf("选中的分辨率是%dx%d\n",a[zi.q[i]],b[zi.q[i]]);
}
    return 0;
}
